import tkinter as tk    # TODO: Сделать графический интерфейс (пока будет консольный UI, позже, когда будет сделан сама программа, будет сделан GUI)
from tkinter import messagebox

MORSE_RUS = {         # Словарь с кириллицы на морзе
    'А': '.-',
    'Б': '-...',
    'В': '.--',
    'Г': '--.',
    'Д': '-..',
    'Е': '.',
    'Ж': '...-',
    'З': '--..',
    'И': '..',
    'Й': '.---',
    'К': '-.-',
    'Л': '.-..',
    'М': '--',
    'Н': '-.',
    'О': '---',
    'П': '.--.',
    'Р': '.-.',
    'С': '...',
    'Т': '-',
    'У': '..-',
    'Ф': '..-.',
    'Х': '....',
    'Ц': '-.-.',
    'Ч': '---.',
    'Ш': '----',
    'Щ': '--.-',
    'Ъ': '--.--',
    'Ы': '-.--',
    'Ь': '-..-',
    'Э': '..-..',
    'Ю': '..--',
    'Я': '.-.-',
}

MORSE_RUS_REVERSE = {v: k for k, v in MORSE_RUS.items()}  # Словарь с морзе на кириллицу

def to_morse(text):  # Функция для перевода текста в морзе

def from_morse(morse_code): # Функция для перевода морзе в текст      



while True: # Вывод меню и обработка выбора пользователя
    print("1. Русский → Морзе")
    print("2. Морзе → Русский")
    print("3. Выход")
    choice = input("Выбор: ")
    
    if choice == '1':
        text = input("Текст: ")
        print(to_morse(text))
    elif choice == '2':
        code = input("Код: ")
        print(from_morse(code))
    elif choice == '3':
        break
    else:
        print("Неверный выбор.")
# TODO:
# - добавить английский
# - сделать GUI
# - написать тесты (возможно, но вряд-ли, (что там тестировать?)